Revit 2027 API
MultiReferenceAnnotationOptions.DimensionLineDirection Property
 The direction vector of the dimension line.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public XYZ DimensionLineDirection { get; set; }
Public Property DimensionLineDirection As XYZ
	Get
	Set
public:
property XYZ^ DimensionLineDirection {
	XYZ^ get ();
	void set (XYZ^ value);
}
member DimensionLineDirection : XYZ with get, set
Property Value
XYZ
Exceptions
Exception | Condition
ArgumentNullException |  When setting this property: A non-optional argument was null
ArgumentOutOfRangeException |  When setting this property: dimensionLineDirection is not length 1.0.
See Also
Reference
MultiReferenceAnnotationOptions Class
Autodesk.Revit.DB Namespace